In [1]:
import pandas as pd  # import pandas libraries

In [3]:
import numpy as np    # import numpy libraries

In [4]:
df = pd.read_csv(r"C:\Users\44754\Documents\tempfile.csv")

In [5]:
df.head(10)  # to see top 5 rows

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41

In [385]:
df.tail()

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41

In [143]:
# accessing a single column

In [387]:
df.head(2)

   EmployeeID Firstname     Lastname  Salary Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000  Manager    Male   31
1           2      Ibtu  Lokhandwala   29000  Manager  Female   27

In [389]:
# add newrow data
newrow = {'EmployeeID' :6,'Firstname':'Ahmedi','Lastname':'Hajari', 'Salary': 31000, 'Jobtitle':'MBA','SEX': 'Male','Age':33}

In [391]:
newrowdf = pd.DataFrame([newrow])

In [393]:
# add newrow data into dataframed
df = pd.concat([df,newrowdf],ignore_index = True)

In [395]:
print(df)

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41
5           6    Ahmedi       Hajari   31000       MBA    Male   33

In [397]:
df.head(10)

   EmployeeID Firstname     Lastname  Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala   25000   Manager    Male   31
1           2      Ibtu  Lokhandwala   29000   Manager  Female   27
2           3  Zulfikar         Khan   32000  Employee    Male   30
3           4    Fatema        shekh   29000  Employee  Female   27
4           5     zenab  lokhandwala   32000       CEO    Male   41
5           6    Ahmedi       Hajari   31000       MBA    Male   33

In [400]:
df.describe() # summary of statatistics

       EmployeeID        Salary        Age
count    6.000000      6.000000   6.000000
mean     3.500000  29666.666667  31.500000
std      1.870829   2658.320272   5.205766
min      1.000000  25000.000000  27.000000
25%      2.250000  29000.000000  27.750000
50%      3.500000  30000.000000  30.500000
75%      4.750000  31750.000000  32.500000
max      6.000000  32000.000000  41.000000

In [406]:
print(df.shape) # no of rows and columns

(6, 7)

In [408]:
print(df['Firstname'])  # access column by name

0     Hasnain
1        Ibtu
2    Zulfikar
3      Fatema
4       zenab
5      Ahmedi
Name: Firstname, dtype: object

In [414]:
 print(df[['Firstname','Lastname']])

  Firstname     Lastname
0   Hasnain  Lokhandwala
1      Ibtu  Lokhandwala
2  Zulfikar         Khan
3    Fatema        shekh
4     zenab  lokhandwala
5    Ahmedi       Hajari

In [416]:
print(df[df['Salary'] >31000])  #  check salary moretahn 31000

   EmployeeID Firstname     Lastname  Salary  Jobtitle   SEX  Age
2           3  Zulfikar         Khan   32000  Employee  Male   30
4           5     zenab  lokhandwala   32000       CEO  Male   41

In [418]:
print(df.isnull().sum()) # checking null value

EmployeeID    0
Firstname     0
Lastname      0
Salary        0
Jobtitle      0
SEX           0
Age           0
dtype: int64

In [420]:
#   Numpy

In [422]:
data = df.to_numpy()

In [424]:
print(data)

[[1 'Hasnain' 'Lokhandwala' 25000 'Manager' 'Male' 31]
 [2 'Ibtu' 'Lokhandwala' 29000 'Manager' 'Female' 27]
 [3 'Zulfikar' 'Khan' 32000 'Employee' 'Male' 30]
 [4 'Fatema' 'shekh' 29000 'Employee' 'Female' 27]
 [5 'zenab' 'lokhandwala' 32000 'CEO' 'Male' 41]
 [6 'Ahmedi' 'Hajari' 31000 'MBA' 'Male' 33]]

In [426]:
salary = df['Salary'].to_numpy()  # for salary

In [428]:
print(salary)

[25000 29000 32000 29000 32000 31000]

In [430]:
age = df['Age'].to_numpy()

In [432]:
print(age)

[31 27 30 27 41 33]

In [436]:
newsalary = salary * 1.10
print('New salary by 10 percent hike', newsalary)

New salary by 10 percent hike [27500. 31900. 35200. 31900. 35200. 34100.]

In [443]:
# increment salary 20 percent whose job title  = manager
df['Salary'] = np.where(df['Jobtitle'] =='Manager', df['Salary'] * 1.20, df['Salary'])

In [445]:
print(df)

   EmployeeID Firstname     Lastname   Salary  Jobtitle     SEX  Age
0           1   Hasnain  Lokhandwala  30000.0   Manager    Male   31
1           2      Ibtu  Lokhandwala  34800.0   Manager  Female   27
2           3  Zulfikar         Khan  32000.0  Employee    Male   30
3           4    Fatema        shekh  29000.0  Employee  Female   27
4           5     zenab  lokhandwala  32000.0       CEO    Male   41
5           6    Ahmedi       Hajari  31000.0       MBA    Male   33

In [455]:
# creating retirement (new column)
retirementage = 50
df['yearretirement'] = np.where(df['Age'] < retirementage, retirementage - df['Age'],0)
print(df)

   EmployeeID Firstname     Lastname   Salary  Jobtitle     SEX  Age  \
0           1   Hasnain  Lokhandwala  30000.0   Manager    Male   31
1           2      Ibtu  Lokhandwala  34800.0   Manager  Female   27
2           3  Zulfikar         Khan  32000.0  Employee    Male   30
3           4    Fatema        shekh  29000.0  Employee  Female   27
4           5     zenab  lokhandwala  32000.0       CEO    Male   41
5           6    Ahmedi       Hajari  31000.0       MBA    Male   33

   yearretirement
0              19
1              23
2              20
3              23
4               9
5              17

In [457]:
# sql

In [459]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\44754\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\44754\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\44754\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

In [463]:
import pandas as pd 
from sqlalchemy import create_engine

In [465]:
df.head()

,EmployeeID,Firstname,Lastname,Salary,Jobtitle,SEX,Age,yearretirement
0,1,Hasnain,Lokhandwala,30000.0,Manager,Male,31,19
1,2,Ibtu,Lokhandwala,34800.0,Manager,Female,27,23
2,3,Zulfikar,Khan,32000.0,Employee,Male,30,20
3,4,Fatema,shekh,29000.0,Employee,Female,27,23
4,5,zenab,lokhandwala,32000.0,CEO,Male,41,9

In [477]:
import mysql.connector

ModuleNotFoundError: No module named 'mysql'

In [479]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.1.0-cp312-cp312-win_amd64.whl.metadata (6.2 kB)
Downloading mysql_connector_python-9.1.0-cp312-cp312-win_amd64.whl (16.1 MB)
   ---------------------------------------- 0.0/16.1 MB ? eta -:--:--
   - -------------------------------------- 0.5/16.1 MB 1.9 MB/s eta 0:00:09
   - -------------------------------------- 0.5/16.1 MB 1.9 MB/s eta 0:00:09
   - -------------------------------------- 0.8/16.1 MB 987.4 kB/s eta 0:00:16
   -- ------------------------------------- 1.0/16.1 MB 1.1 MB/s eta 0:00:14
   --- ------------------------------------ 1.6/16.1 MB 1.3 MB/s eta 0:00:11
   ---- ----------------------------------- 1.8/16.1 MB 1.3 MB/s eta 0:00:11
   ----- ---------------------------------- 2.4/16.1 MB 1.4 MB/s eta 0:00:10
   ------ --------------------------------- 2.6/16.1 MB 1.5 MB/s eta 0:00:10
   ------- -------------------------------- 2.9/16.1 MB 1.5 MB/s eta 0:00:09
   ------- -------------------------------- 3.1/16.1 MB 1.4 MB/s eta 0:00:10
   -------- ------------------------------- 3.4/16.1 MB 1.4 MB/s eta 0:00:09
   --------- ------------------------------ 3.9/16.1 MB 1.5 MB/s eta 0:00:09
   ---------- ----------------------------- 4.2/16.1 MB 1.5 MB/s eta 0:00:09
   ----------- ---------------------------- 4.5/16.1 MB 1.5 MB/s eta 0:00:08
   ------------ --------------------------- 5.0/16.1 MB 1.5 MB/s eta 0:00:08
   ------------- -------------------------- 5.2/16.1 MB 1.5 MB/s eta 0:00:08
   ------------- -------------------------- 5.5/16.1 MB 1.5 MB/s eta 0:00:07
   --------------- ------------------------ 6.0/16.1 MB 1.5 MB/s eta 0:00:07
   --------------- ------------------------ 6.3/16.1 MB 1.5 MB/s eta 0:00:07
   ---------------- ----------------------- 6.6/16.1 MB 1.5 MB/s eta 0:00:07
   ----------------- ---------------------- 7.1/16.1 MB 1.5 MB/s eta 0:00:06
   ------------------ --------------------- 7.3/16.1 MB 1.6 MB/s eta 0:00:06
   ------------------ --------------------- 7.6/16.1 MB 1.6 MB/s eta 0:00:06
   -------------------- ------------------- 8.1/16.1 MB 1.6 MB/s eta 0:00:06
   -------------------- ------------------- 8.4/16.1 MB 1.6 MB/s eta 0:00:05
   ---------------------- ----------------- 8.9/16.1 MB 1.6 MB/s eta 0:00:05
   ---------------------- ----------------- 9.2/16.1 MB 1.6 MB/s eta 0:00:05
   ----------------------- ---------------- 9.4/16.1 MB 1.6 MB/s eta 0:00:05
   ------------------------ --------------- 9.7/16.1 MB 1.6 MB/s eta 0:00:05
   ------------------------ --------------- 10.0/16.1 MB 1.6 MB/s eta 0:00:04
   ------------------------- -------------- 10.2/16.1 MB 1.5 MB/s eta 0:00:04
   -------------------------- ------------- 10.7/16.1 MB 1.6 MB/s eta 0:00:04
   --------------------------- ------------ 11.0/16.1 MB 1.6 MB/s eta 0:00:04
   ---------------------------- ----------- 11.3/16.1 MB 1.6 MB/s eta 0:00:04
   ----------------------------- ---------- 11.8/16.1 MB 1.6 MB/s eta 0:00:03
   ------------------------------ --------- 12.1/16.1 MB 1.6 MB/s eta 0:00:03
   ------------------------------- -------- 12.6/16.1 MB 1.6 MB/s eta 0:00:03
   ------------------------------- -------- 12.8/16.1 MB 1.6 MB/s eta 0:00:03
   -------------------------------- ------- 13.1/16.1 MB 1.6 MB/s eta 0:00:02
   --------------------------------- ------ 13.6/16.1 MB 1.6 MB/s eta 0:00:02
   ---------------------------------- ----- 13.9/16.1 MB 1.6 MB/s eta 0:00:02
   ----------------------------------- ---- 14.4/16.1 MB 1.6 MB/s eta 0:00:02
   ------------------------------------ --- 14.7/16.1 MB 1.6 MB/s eta 0:00:01
   ------------------------------------- -- 14.9/16.1 MB 1.6 MB/s eta 0:00:01
   -------------------------------------- - 15.5/16.1 MB 1.6 MB/s eta 0:00:01
   ---------------------------------------  15.7/16.1 MB 1.6 MB/s eta 0:00:01
   ---------------------------------------- 16.1/16.1 MB 1.6 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.1.0
Note: you may need to restart the kernel to use updated packages.

In [481]:
import mysql.connector

In [483]:
dbconnection = mysql.connector.connect( host = 'localhost', user = 'root', password = 'root', database = 'challenge1')

In [485]:
cursor = dbconnection.cursor()

In [493]:
query = 'select * from employee1'
cursor.execute(query)

In [495]:
rows = cursor.fetchall()

In [499]:
print(rows)

[(1, 'Hasnain', 'Lokhandwala', 25000, 'Manager', 'Male', 31), (2, 'Ibtu', 'Lokhandwala', 29000, 'Manager', 'Female', 27), (3, 'Zulfikar', 'Khan', 32000, 'Employee', 'Male', 30), (4, 'Fatema', 'shekh', 29000, 'Employee', 'Female', 27), (5, 'zenab', 'lokhandwala', 32000, 'CEO', 'Male', 41)]